backend/app/controllers/game_sessions_controller.rb

SELECT "game_sessions".* FROM "game_sessions"
---
    def index
        render json: GameSession.all

INSERT INTO "game_sessions" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 1], ["created_at", "2019-12-30 19:34:31.455189"], ["updated_at", "2019-12-30 19:34:31.455189"]]
---
    def create
        game_session = GameSession.create(gs_params)

SELECT "game_sessions".* FROM "game_sessions" WHERE "game_sessions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "game_sessions" SET "missile_size" = ?, "updated_at" = ? WHERE "game_sessions"."id" = ?  [["missile_size", "medium"], ["updated_at", "2019-12-30 20:00:16.444037"], ["id", 1]]
---
    def update
        game_session = GameSession.find(params[:id])
        game_session.update(gs_params)