backend/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "qq"], ["created_at", "2019-12-30 16:32:22.514400"], ["updated_at", "2019-12-30 16:32:22.514400"]]
---
    def create
        @user = User.create(params.require(:users).permit(:name))